# 6.1 Letter Casing and Whitespace

In [15]:
import pandas as pd

In [16]:
inspections=pd.read_csv("chicago_food_inspections.csv")
inspections

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [17]:
inspections["Name"].head()

0     MARRIOT MARQUIS CHICAGO
1                    JETS PIZZA
2                     ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                  CHARTWELLS
Name: Name, dtype: object

In [18]:
inspections["Name"].head().values

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [19]:
inspections["Name"].str

In [20]:
dessert="   dessert   "
dessert.lstrip()

'dessert   '

In [21]:
dessert.rstrip()

'   dessert'

In [22]:
dessert.strip()

'dessert'

In [23]:
inspections["Name"].str.lstrip().head()

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3     MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [24]:
inspections["Name"].str.rstrip().head()

0      MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                   CHARTWELLS
Name: Name, dtype: object

In [25]:
inspections["Name"].str.strip().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [26]:
inspections["Name"] = inspections["Name"].str.strip()

In [27]:
inspections.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [28]:
inspections.columns

Index(['Name', 'Risk'], dtype='object')

In [30]:
for column in inspections.columns:
    inspections[column]=inspections[column].str.strip()

In [31]:
inspections["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [32]:
 steaks = pd.Series(["porterhouse", "filet mignon", "ribeye"])

In [33]:
steaks

0     porterhouse
1    filet mignon
2          ribeye
dtype: object

In [34]:
 steaks.str.upper()

0     PORTERHOUSE
1    FILET MIGNON
2          RIBEYE
dtype: object

In [58]:
inspections["Name"].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [59]:
inspections["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

## Just Example

In [35]:
'hello'.upper()

'HELLO'

In [36]:
inspections["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

In [37]:
inspections["Name"].map(str.title).head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

In [38]:
inspections.head()

                      Name             Risk
0  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1               JETS PIZZA  Risk 2 (Medium)
2                ROOM 1520     Risk 3 (Low)
3  MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4               CHARTWELLS    Risk 1 (High)

In [57]:
inspections.apply(lambda x: x.str.upper())

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    RISK 1 (HIGH)
1                         JETS PIZZA  RISK 2 (MEDIUM)
2                          ROOM 1520     RISK 3 (LOW)
3            MARRIOT MARQUIS CHICAGO    RISK 1 (HIGH)
4                         CHARTWELLS    RISK 1 (HIGH)
...                              ...              ...
153805                     WOLCOTT'S    RISK 1 (HIGH)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  RISK 2 (MEDIUM)
153807                      CAFE 608    RISK 1 (HIGH)
153808                   MR.DANIEL'S    RISK 1 (HIGH)
153809                    TEMPO CAFE    RISK 1 (HIGH)

[153810 rows x 2 columns]

In [59]:
##inspections.applymap(str.upper, ignore_na=True)

In [56]:
inspections.iloc[:100,1].str[-5:]

0     High)
1     dium)
2     (Low)
3     High)
4     High)
      ...
95    dium)
96    High)
97    High)
98    High)
99    High)
Name: Risk, Length: 100, dtype: object

## 6.2 String Slicing

In [60]:
inspections["Risk"].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: object

In [61]:
len(inspections)

153810

In [65]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [66]:
inspections=inspections.dropna(subset="Risk")

In [68]:
inspections=inspections.replace(to_replace="All", value="Risk 4 (extreme)")

In [70]:
inspections["Risk"].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)',
       'Risk 4 (extreme)'], dtype=object)

## 6.2.1 String Slicing and Character Replacement

In [76]:
inspections["Risk"].str.slice(5,6).head(20)

0     1
1     2
2     3
3     1
4     1
5     2
6     1
7     1
8     2
9     1
10    2
11    1
12    1
13    1
14    1
15    1
16    1
17    2
18    1
19    1
Name: Risk, dtype: object

## String slicing and character replacement

In [78]:
inspections["Risk"].str[5:6]

0         1
1         2
2         3
3         1
4         1
         ..
153805    1
153806    2
153807    1
153808    1
153809    1
Name: Risk, Length: 153744, dtype: object

In [79]:
inspections["Risk"].str.slice(8)

0           High)
1         Medium)
2            Low)
3           High)
4           High)
           ...
153805      High)
153806    Medium)
153807      High)
153808      High)
153809      High)
Name: Risk, Length: 153744, dtype: object

In [85]:
inspections["Risk"].str[8:]

0           High)
1         Medium)
2            Low)
3           High)
4           High)
           ...
153805      High)
153806    Medium)
153807      High)
153808      High)
153809      High)
Name: Risk, Length: 153744, dtype: object

In [86]:
inspections["Risk"].str.slice(8,-1)

0           High
1         Medium
2            Low
3           High
4           High
           ...
153805      High
153806    Medium
153807      High
153808      High
153809      High
Name: Risk, Length: 153744, dtype: object

In [87]:
inspections["Risk"].str[8:-1]

0           High
1         Medium
2            Low
3           High
4           High
           ...
153805      High
153806    Medium
153807      High
153808      High
153809      High
Name: Risk, Length: 153744, dtype: object

In [89]:
inspections["Risk"].str.slice(8).str.replace(")","")

C:\Users\u\AppData\Local\Temp\ipykernel_2604\3142268625.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  inspections["Risk"].str.slice(8).str.replace(")","")

0           High
1         Medium
2            Low
3           High
4           High
           ...
153805      High
153806    Medium
153807      High
153808      High
153809      High
Name: Risk, Length: 153744, dtype: object

## Boolean methods

In [90]:
"Pizza" in "Jett Pizza"

True

In [91]:
"pizza" in "Jett Pizza"

False

In [94]:
inspections["Name"].str.lower().str.contains("pizza")

0         False
1          True
2         False
3         False
4         False
          ...
153805    False
153806    False
153807    False
153808    False
153809    False
Name: Name, Length: 153744, dtype: bool

In [96]:
has_pizza=inspections["Name"].str.lower().str.contains("pizza")

In [97]:
inspections[has_pizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [99]:
inspections["Name"].str.lower().str.startswith("tacos")

0         False
1         False
2         False
3         False
4         False
          ...
153805    False
153806    False
153807    False
153808    False
153809    False
Name: Name, Length: 153744, dtype: bool

In [100]:
start_with_tacos=inspections["Name"].str.lower().str.startswith("tacos")

In [102]:
inspections[start_with_tacos]

                         Name           Risk
69               TACOS NIETOS  Risk 1 (High)
556       TACOS EL TIO 2 INC.  Risk 1 (High)
675          TACOS DON GABINO  Risk 1 (High)
958       TACOS EL TIO 2 INC.  Risk 1 (High)
1036      TACOS EL TIO 2 INC.  Risk 1 (High)
...                       ...            ...
143587          TACOS DE LUNA  Risk 1 (High)
144026           TACOS GARCIA  Risk 1 (High)
146174        Tacos Place's 1  Risk 1 (High)
147810  TACOS MARIO'S LIMITED  Risk 1 (High)
151191            TACOS REYNA  Risk 1 (High)

[105 rows x 2 columns]

In [103]:
end_with_tacos=inspections["Name"].str.lower().str.endswith("tacos")

In [104]:
inspections[end_with_tacos]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]

## 6.5 Splitting strings

In [106]:
customers=pd.read_csv("customers.csv")

In [107]:
customers

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [108]:
customers["Name"].str.len()

0       13
1       17
2       15
3       19
4       14
        ..
9956    13
9957    15
9958    10
9959    16
9960    16
Name: Name, Length: 9961, dtype: int64

In [111]:
 phone_number = "555-123-4567"
phone_number.split("-")

['555', '123', '4567']

In [113]:
customers["Name"].str.split(pat=" ").head()  #pattern

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [114]:
customers["Name"].str.split(" ").head()

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [119]:
customers["Name"].str.split(" ").str.len()

0       2
1       2
2       2
3       3
4       2
       ..
9956    2
9957    2
9958    2
9959    2
9960    2
Name: Name, Length: 9961, dtype: int64

In [120]:
customers["Name"].str.split(pat=" ", n=1).head()  #pattern

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [127]:
customers["Name"].str.split(pat=" ", n=1).str.get(0).head()

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [128]:
customers["Name"].str.split(pat=" ", n=1).str.get(1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [129]:
customers["Name"].str.split(pat=" ",n=1).str.get(-1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [130]:
customers["Name"].str.split(pat=" ", n=1, expand=True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [131]:
customers["Name"].str.split(pat=" ", expand=True).head()

           0         1     2
0      Frank   Manning  None
1  Elizabeth   Johnson  None
2     Donald  Stephens  None
3    Michael   Vincent   III
4    Jasmine    Zamora  None

In [132]:
customers[["Firstname","Lastname"]]=customers["Name"].str.split(pat=" ", n=1,expand=True)

In [133]:
customers

,Name,Address,Firstname,Lastname
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [136]:
customers=customers.drop(labels="Name", axis=True)

In [137]:
customers

,Address,Firstname,Lastname
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

## 6.6 Coding challenge

In [151]:
customers["Address"].str.split(",",n=4).str.get(1)

0        East Matthew
1            Kyleport
2         Prestonstad
3          Jimmymouth
4           Karamouth
            ...
9956       North Paul
9957      Lake Marcia
9958      Watsonville
9959        Haleyfurt
9960        Davidtown
Name: Address, Length: 9961, dtype: object

In [154]:
customers[["Street", "City", "State",  "Zip"]]=customers["Address"].str.split(",",n=4,expand=True)

In [156]:
customers=customers.drop(labels="Address",axis=True)

In [161]:
customers.tail()

,Firstname,Lastname,Street,City,State,Zip
9956,Dana,Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda,Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric,Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor,Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry,Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

## 6.7 A note on regular expressions

In [163]:
customers["Street"].head()

0             6461 Quinn Groves
1    1360 Tracey Ports Apt. 419
2          19120 Fleming Manors
3              441 Olivia Creek
4    4246 Chelsey Ford Apt. 310
Name: Street, dtype: object

In [169]:
customers["Street"].str.replace("\d{4,}", "*",regex=True).head()

0             * Quinn Groves
1    * Tracey Ports Apt. 419
2           * Fleming Manors
3           441 Olivia Creek
4    * Chelsey Ford Apt. 310
Name: Street, dtype: object